In [1]:
#4.1
import pandas as pd
data=pd.Series([2,"4",6,8,10],index=["a","b","c","d","e"])
data

a     2
b     4
c     6
d     8
e    10
dtype: object

In [2]:
#4.2 converting pandas List to python List
#we use predefined method ............tolist()
#i.
list_data=data.tolist()
print("List",list_data)

List [2, '4', 6, 8, 10]

In [3]:
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily','Michael', 
'Matthew', 'Laura', 'Kevin', 'Jonas'], 
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} 
#index labels
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
dataframe=pd.DataFrame(exam_data,index=labels)
dataframe

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [4]:
# ii
#change 'James" to 'Suresh'
dataframe["name"]=dataframe["name"].replace('James','Suresh')
dataframe

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [5]:
#get the datatype of each column
datatypes=dataframe.dtypes
datatypes

name         object
score       float64
attempts      int64
qualify      object
dtype: object

In [6]:
#iii
#Write a Pandas program to insert a new column in existing DataFrame.
import pandas as pd
dataframe["age"]=[20,20,21,22,22,23,21,21,24,22]
print(dataframe)

        name  score  attempts qualify  age
a  Anastasia   12.5         1     yes   20
b       Dima    9.0         3      no   20
c  Katherine   16.5         2     yes   21
d     Suresh    NaN         3      no   22
e      Emily    9.0         2      no   22
f    Michael   20.0         3     yes   23
g    Matthew   14.5         1     yes   21
h      Laura    NaN         1      no   21
i      Kevin    8.0         2      no   24
j      Jonas   19.0         1     yes   22

In [8]:
#iv)Write a Pandas program to get list from DataFrame column headers
column_headers=dataframe.columns.tolist()
column_headers

['name', 'score', 'attempts', 'qualify', 'age']